src/Documents/ПроизводственноеЗадание/ПроизводственноеЗадание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроизводственноеЗадание</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерОчереди</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратнаяТара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапуска</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаГрупповойУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинияSMD</name>
    <type>
      <types>CatalogRef.ЛинииSMD</types>
    </type>
  </attributes>
  <attributes>
    <name>Остановлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Перемещено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Испытания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СторонняяПоверка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаРасходов</name>
      <type>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналогНормыРасходов</name>
      <type>
        <types>CatalogRef.АналогиНормРасходов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оборудование</name>
    <attributes>
      <name>ТехОперация</name>
      <type>
        <types>CatalogRef.ТехОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.ТехОснастка</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Канбаны</name>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>МТК</name>
      <type>
        <types>DocumentRef.МаршрутнаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Прессформы</name>
    <attributes>
      <name>Станок</name>
      <type>
        <types>CatalogRef.ТехОснастка</types>
      </type>
    </attributes>
    <attributes>
      <name>Прессформа</name>
      <type>
        <types>CatalogRef.ТехОснастка</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/ТехОснастка/ТехОснастка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТехОснастка</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>CatalogRef.Документация</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОснасток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВРаботе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/ПроизводственноеЗадание/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
ЭтотОбъект.ТолькоПросмотр = ОбщийМодульСозданиеДокументов.ЗапретРедактирования(Объект.Ссылка,Истина,Ложь);
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокОборудования(СписокОборудования,ТехОперация)
	Для каждого ТЧ Из ТехОперация.Оборудование Цикл
	СписокОборудования.Добавить(ТЧ.Оборудование);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокТО(ЭтапСпецификации,СписокТО)
ВыборкаНР = ОбщийМодульВызовСервера.ПолучитьНормыРасходовПоВладельцу_Н_ТО(ЭтапСпецификации,Объект.ДатаЗапуска);
	Пока ВыборкаНР.Следующий() Цикл
		Если ТипЗнч(ВыборкаНР.Элемент) = Тип("СправочникСсылка.Номенклатура") Тогда
			Если ВыборкаНР.Элемент.Канбан.Пустая() Тогда
			ПолучитьСписокТО(ВыборкаНР.Элемент,СписокТО);
			КонецЕсли;
		Иначе	
    	СписокТО.Добавить(ВыборкаНР.Элемент);		
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОборудованиеТехОперацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;

СписокТО = Новый СписокЗначений;

ПолучитьСписокТО(Объект.Изделие,СписокТО);
ТО = СписокТО.ВыбратьЭлемент("Выберите тех. операцию");
	Если ТО <> Неопределено Тогда
	Элементы.Оборудование.ТекущиеДанные.ТехОперация = ТО.Значение; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОборудованиеОборудованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
СписокОборудования = Новый СписокЗначений;

ПолучитьСписокОборудования(СписокОборудования, Элементы.Оборудование.ТекущиеДанные.ТехОперация);
ВыбОборудование = СписокОборудования.ВыбратьЭлемент("Выберите оборудование");
	Если ВыбОборудование <> Неопределено Тогда
	Элементы.Оборудование.ТекущиеДанные.Оборудование = ВыбОборудование.Значение;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ОборудованиеТехОперацияПриИзмененииНаСервере(Стр)
ТЧ = Объект.Оборудование.НайтиПоИдентификатору(Стр);
ТЧ.Оборудование = Справочники.ТехОснастка.ПустаяСсылка();
ТЧ.Исполнитель = Справочники.Сотрудники.ПустаяСсылка();
КонецПроцедуры

&НаКлиенте
Процедура ОборудованиеТехОперацияПриИзменении(Элемент)
ОборудованиеТехОперацияПриИзмененииНаСервере(Элементы.Оборудование.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокИсполнителей(ТО)
СписокИсполнителей = Новый СписокЗначений;

	Для каждого ТЧ Из ТО.Оборудование Цикл	
	СписокИсполнителей.Добавить(ТЧ.Сотрудник,СокрЛП(ТЧ.Сотрудник.Наименование)+" ("+СокрЛП(ТЧ.Оборудование.Наименование)+")");
	КонецЦикла;
Возврат(СписокИсполнителей); 
КонецФункции

&НаСервере
Функция ПолучитьОборудование(ТО,Исполнитель)
	Для каждого ТЧ Из ТО.Оборудование Цикл	
		Если ТЧ.Сотрудник = Исполнитель Тогда
		Возврат(ТЧ.Оборудование);
		КонецЕсли;
	КонецЦикла;
Возврат(Справочники.Сотрудники.ПустаяСсылка()); 
КонецФункции 

&НаКлиенте
Процедура ОборудованиеИсполнительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
СписокИсполнителей = ПолучитьСписокИсполнителей(Элементы.Оборудование.ТекущиеДанные.ТехОперация);
Исполнитель = СписокИсполнителей.ВыбратьЭлемент("Выберите исполнителя");
	Если Исполнитель <> Неопределено Тогда
	Элементы.Оборудование.ТекущиеДанные.Исполнитель = Исполнитель.Значение; 
	Элементы.Оборудование.ТекущиеДанные.Оборудование = ПолучитьОборудование(Элементы.Оборудование.ТекущиеДанные.ТехОперация,Исполнитель.Значение);
	КонецЕсли;
КонецПроцедуры
